### Pandas - Dataframe and Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning.
It provides two primary data structures: Series and Dataframes. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable and potentially heterogeneous tabular data structure with labeled axes(rows and columns).

In [43]:
import pandas as pd

In [44]:
#Series
#Panda Series is a one dimensional array like object that can hold any data type. It is similar to a column in table.

import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series: \n", series)
print(type(series))

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [45]:
# Create a Series from dictionary elements
data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print("Series: \n", series_dict)
print(type(series_dict))

Series:
 a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

In [46]:
data = [10,20,30]
index = ['a','b','c']

pd.Series(data, index)

a    10
b    20
c    30
dtype: int64

In [47]:
##DataFrame
##Create a DataFrame from a dictionary of list
data = {
    'name':['Krish','Talib','John','Naajid'],
    'age':[25,30,35,40],
    'city':['Bangalore','Hyderabad','New York', 'Florida']
}

df = pd.DataFrame(data)
df.head()

     name  age       city
0   Krish   25  Bangalore
1   Talib   30  Hyderabad
2    John   35   New York
3  Naajid   40    Florida

In [48]:
print(df)
print(type(df))

     name  age       city
0   Krish   25  Bangalore
1   Talib   30  Hyderabad
2    John   35   New York
3  Naajid   40    Florida
<class 'pandas.core.frame.DataFrame'>

In [49]:
#Create a dataframe from list of dictionaries
data =[
    {
        'name':'Krish',
        'age':25,
        'city':'Bangalore'
    },{
        'name':'John',
        'age':30,
        'city':'New York'
    },{
        'name':'Naajid',
        'age':35,
        'city':'Florida'
    },{
        'name':'Talib',
        'age':40,
        'city':'Hyderabad'
    }
]

df = pd.DataFrame(data)
df.head()

     name  age       city
0   Krish   25  Bangalore
1    John   30   New York
2  Naajid   35    Florida
3   Talib   40  Hyderabad

In [50]:
df=pd.read_csv('sales_data.csv',encoding="latin1")
df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2823 entries, 0 to 2822
Data columns (total 25 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ORDERNUMBER       2823 non-null   int64
 1   QUANTITYORDERED   2823 non-null   int64
 2   PRICEEACH         2823 non-null   float64
 3   ORDERLINENUMBER   2823 non-null   int64
 4   SALES             2823 non-null   float64
 5   ORDERDATE         2823 non-null   object
 6   STATUS            2823 non-null   object
 7   QTR_ID            2823 non-null   int64
 8   MONTH_ID          2823 non-null   int64
 9   YEAR_ID           2823 non-null   int64
 10  PRODUCTLINE       2823 non-null   object
 11  MSRP              2823 non-null   int64
 12  PRODUCTCODE       2823 non-null   object
 13  CUSTOMERNAME      2823 non-null   object
 14  PHONE             2823 non-null   object
 15  ADDRESSLINE1      2823 non-null   object
 16  ADDRESSLINE2      302 non-null    object
 17  CITY              2823 non-null   object
 18  STATE             1337 non-null   object
 19  POSTALCODE        2747 non-null   object
 20  COUNTRY           2823 non-null   object
 21  TERRITORY         1749 non-null   object
 22  CONTACTLASTNAME   2823 non-null   object
 23  CONTACTFIRSTNAME  2823 non-null   object
 24  DEALSIZE          2823 non-null   object
dtypes: float64(2), int64(7), object(16)
memory usage: 551.5+ KB

In [52]:
df.describe()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,QTR_ID,MONTH_ID,YEAR_ID,MSRP
count,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.00000,2823.000000
mean,10258.725115,35.092809,83.658544,6.466171,3553.889072,2.717676,7.092455,2003.81509,100.715551
std,92.085478,9.741443,20.174277,4.225841,1841.865106,1.203878,3.656633,0.69967,40.187912
min,10100.000000,6.000000,26.880000,1.000000,482.130000,1.000000,1.000000,2003.00000,33.000000
25%,10180.000000,27.000000,68.860000,3.000000,2203.430000,2.000000,4.000000,2003.00000,68.000000
50%,10262.000000,35.000000,95.700000,6.000000,3184.800000,3.000000,8.000000,2004.00000,99.000000
75%,10333.500000,43.000000,100.000000,9.000000,4508.000000,4.000000,11.000000,2004.00000,124.000000
max,10425.000000,97.000000,100.000000,18.000000,14082.800000,4.000000,12.000000,2005.00000,214.000000

In [53]:
import numpy as np
np.array(df)
np.shape(df)

(2823, 25)

In [54]:
df['SALES'].mode()

0    3003.0
Name: SALES, dtype: float64

In [55]:
df.isnull().sum()

ORDERNUMBER            0
QUANTITYORDERED        0
PRICEEACH              0
ORDERLINENUMBER        0
SALES                  0
ORDERDATE              0
STATUS                 0
QTR_ID                 0
MONTH_ID               0
YEAR_ID                0
PRODUCTLINE            0
MSRP                   0
PRODUCTCODE            0
CUSTOMERNAME           0
PHONE                  0
ADDRESSLINE1           0
ADDRESSLINE2        2521
CITY                   0
STATE               1486
POSTALCODE            76
COUNTRY                0
TERRITORY           1074
CONTACTLASTNAME        0
CONTACTFIRSTNAME       0
DEALSIZE               0
dtype: int64

In [56]:
df.tail()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,Torikatu 38,NaN,Oulu,NaN,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,8616 Spinnaker Dr.,NaN,Boston,MA,51003,USA,NaN,Yoshido,Juri,Medium

In [57]:
##Accessing data from dataframe
data

[{'name': 'Krish', 'age': 25, 'city': 'Bangalore'},
 {'name': 'John', 'age': 30, 'city': 'New York'},
 {'name': 'Naajid', 'age': 35, 'city': 'Florida'},
 {'name': 'Talib', 'age': 40, 'city': 'Hyderabad'}]

In [58]:
df = pd.DataFrame(data)

In [59]:
df

     name  age       city
0   Krish   25  Bangalore
1    John   30   New York
2  Naajid   35    Florida
3   Talib   40  Hyderabad

In [60]:
print(df['name'])
print(type(df['name']))

0     Krish
1      John
2    Naajid
3     Talib
Name: name, dtype: object
<class 'pandas.core.series.Series'>

In [61]:
df.loc[0] #Access 0th row - used for row index

name        Krish
age            25
city    Bangalore
Name: 0, dtype: object

In [62]:
df.iloc[0]

name        Krish
age            25
city    Bangalore
Name: 0, dtype: object

In [63]:

df['name']

0     Krish
1      John
2    Naajid
3     Talib
Name: name, dtype: object

In [67]:
#Accessing a specific element
print(df.at[1,'age'])

30

In [68]:
print(df.at[1,'name'])

John

In [69]:
#Accessing a specific element using iat
df.iat[2,2]

'Florida'

In [70]:
#Data manipulation with DataFrame
df

     name  age       city
0   Krish   25  Bangalore
1    John   30   New York
2  Naajid   35    Florida
3   Talib   40  Hyderabad

In [76]:
#Adding a column to the DataFrame
df['Salary'] = [50000,60000,70000,80000]

In [77]:
df

     name  age       city  Salary
0   Krish   25  Bangalore   50000
1    John   30   New York   60000
2  Naajid   35    Florida   70000
3   Talib   40  Hyderabad   80000

In [84]:
#Remove a column
df.drop('Salary', axis=1, inplace=True) #By default axis=0 which is row values, we have to set axis=1 for column values
#inplace -> to save the state of the DataFrame after removing the column. Else, the drop column will be shown again as drop is not a permanent operation

In [85]:
df

     name  age       city
0   Krish   25  Bangalore
1    John   30   New York
2  Naajid   35    Florida
3   Talib   40  Hyderabad

In [90]:
##Increment age
df['age'] = df['age']+1

In [91]:
df

     name  age       city
1    John   32   New York
2  Naajid   37    Florida
3   Talib   42  Hyderabad

In [92]:
# Remove a row data
df.drop(1, inplace=True)
df

     name  age       city
2  Naajid   37    Florida
3   Talib   42  Hyderabad

In [94]:
df= pd.read_csv('sales_data.csv', encoding='latin1')
df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [96]:
#display the data types of each column
print("Data Types:\n", df.dtypes)

Data Types:
 ORDERNUMBER           int64
QUANTITYORDERED       int64
PRICEEACH           float64
ORDERLINENUMBER       int64
SALES               float64
ORDERDATE            object
STATUS               object
QTR_ID                int64
MONTH_ID              int64
YEAR_ID               int64
PRODUCTLINE          object
MSRP                  int64
PRODUCTCODE          object
CUSTOMERNAME         object
PHONE                object
ADDRESSLINE1         object
ADDRESSLINE2         object
CITY                 object
STATE                object
POSTALCODE           object
COUNTRY              object
TERRITORY            object
CONTACTLASTNAME      object
CONTACTFIRSTNAME     object
DEALSIZE             object
dtype: object

In [97]:
#Describe the data frame
print("Statistical Summary:\n", df.describe())

Statistical Summary:
         ORDERNUMBER  QUANTITYORDERED    PRICEEACH  ORDERLINENUMBER  \
count   2823.000000      2823.000000  2823.000000      2823.000000
mean   10258.725115        35.092809    83.658544         6.466171
std       92.085478         9.741443    20.174277         4.225841
min    10100.000000         6.000000    26.880000         1.000000
25%    10180.000000        27.000000    68.860000         3.000000
50%    10262.000000        35.000000    95.700000         6.000000
75%    10333.500000        43.000000   100.000000         9.000000
max    10425.000000        97.000000   100.000000        18.000000

              SALES       QTR_ID     MONTH_ID     YEAR_ID         MSRP
count   2823.000000  2823.000000  2823.000000  2823.00000  2823.000000
mean    3553.889072     2.717676     7.092455  2003.81509   100.715551
std     1841.865106     1.203878     3.656633     0.69967    40.187912
min      482.130000     1.000000     1.000000  2003.00000    33.000000
25%     2203.430000     2.000000     4.000000  2003.00000    68.000000
50%     3184.800000     3.000000     8.000000  2004.00000    99.000000
75%     4508.000000     4.000000    11.000000  2004.00000   124.000000
max    14082.800000     4.000000    12.000000  2005.00000   214.000000

In [100]:
df['SALES'].mode()

0    3003.0
Name: SALES, dtype: float64

In [ ]:
#Group by a column and aggregate